[
  {
    "name": "Iyyara & Halalfoodhunt",
    "myRole": "Back-end",
    "shortDes": "Iyyara & Halalfoodhunt is an app from Singapore that verifies halal food options (eateries, online businesses, food vendors, etc.) before publishing them.",
    "startDate": "08/2023",
    "endDate": "Present",
    "descriptions": [
      "Developed RESTful APIs for a new module using Express.js and Prisma, ensuring data integrity with thorough testing.",
      "Implemented Stripe payments and business logic to create custom subscription plans.",
      "Configured CI/CD pipeline to deploy the product to staging and production environments using GitLab CI/CD, and Docker.",
      "Created a scheduled database backup strategy with Shell Script for self-deployed MongoDB."
    ],
    "keyTechs": [
      "JavaScript", "TypeScript", "Meteor.js", "Express.js", "Prisma", "MongoDB", "Docker", "GitLab CI/CD", "Shell Script", "AWS S3"
    ],
    "teamsize": 7
  },
  {
    "name": "Tico E-commerce",
    "myRole": "Back-end",
    "shortDes": "Tico E-commerce is a set of commerce tools and modules that can be used to build unique commerce experiences.",
    "startDate": "11/2022",
    "endDate": "Present",
    "descriptions": [
      "Conducted in-depth analysis and research on popular Open-source platforms to plan and break down features.",
      "Leveraged my expertise in Python, FastAPI and PostgreSQL to build a scalable and high-performance e-commerce module that seamlessly integrates with existing systems.",
      "Configured Nginx as a scalable API Gateway and Load Balancer, following best practices to ensure security, and optimal performance.",
      "Established a seamless integration for diverse payment gateways (VNPay, Momo, Stripe) and shipping providers (GHTK, GHN) within the system."
    ],
    "keyTechs": [
      "Python", "FastAPI", "SQLAlchemy", "PostgreSQL", "Docker", "Nginx", "Pytest", "GitLab CI/CD", "AWS EC2"
    ],
    "teamsize": 8
  },
  {
    "name": "Early Parrot",
    "myRole": "Full-stack",
    "shortDes": "EarlyParrot is a <b>SaaS</b> referral marketing platform from Malta that includes marketing automation tools, tracking and analytics features.",
    "startDate": "07/2023",
    "endDate": "02/2024",
    "descriptions": [
      "Build the UI using AngularJS and Bootstrap to provide a smooth experience.",
      "Develop features to support clients in tracking their referral numbers.",
      "Develop data synchronization features and ensure the consistency of user data from various SaaS providers.",
      "Resolve race conditions in existing features and during large data synchronization."
    ],
    "keyTechs": [
      "JavaScript", "Express.js", "Async.js", "Mongoose", "MongoDB", "Angular.js", "Bootstrap", "Linux", "Agenda.js", "PM2"
    ],
    "teamsize": 3
  },
  {
    "name": "Mark Platform",
    "myRole": "Back-end",
    "shortDes": "Mark Platform is a platform that connects homeowners with top-rated interior designers in Singapore.",
    "startDate": "08/2022",
    "endDate": "06/2023",
    "descriptions": [
      "Create middleware to dynamically authorize user roles.",
      "Use FastAPI to develop APIs and create automated tests with Pytest.",
      "Integrate Stripe Payments API to create a subscription system.",
      "Configure CI/CD pipeline for automatic deployment using Docker, and Nginx on a DigitalOcean Droplet."
    ],
    "keyTechs": [
      "Python", "FastAPI", "PostgreSQL", "SQLAlchemy", "Pytest", "Firebase", "Docker", "Nginx", "GitLab CI/CD", "Shell Script"
    ],
    "teamsize": 6
  }
]